modules/sbs/dtbook-to-odt/src/main/doc/dtbook-to-odt.org
#+TITLE: DTBook to ODT
*                                                          :noexport:ARCHIVE:
#+OPTIONS: num:nil toc:nil ^:nil
#+HTML_HEAD: <link rev="doc" href="../resources/xml/dtbook-to-odt.xpl" vocab="http://www.daisy.org/ns/pipeline/"/>
#+HTML_HEAD: <meta about="../resources/xml/dtbook-to-odt.xpl" property="rdf:type" resource="http://www.daisy.org/ns/pipeline/script"/>
#+HTML_HEAD: <link rel="rdf:type" href="http://www.daisy.org/ns/pipeline/userdoc"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="style.css" />
#+HTML_HEAD: <script src="script.js"></script>
#+BEGIN_SRC emacs-lisp
  (setq org-src-lang-modes (append org-src-lang-modes
                                   '(("odt" . nxml) ("dtbook" . nxml))))
#+END_SRC

* Headings

Headings get the paragraph style “Überschrift 1” and are preceded and
followed by an empty paragraph.

#+BEGIN_SRC dtbook
  <dtb:h1>
      Klappentext
  </dtb:h1>
#+END_SRC
#+BEGIN_SRC odt
  <text:p text:style-name="Standard"/>
  <text:h text:outline-level="1" text:style-name="Überschrift_20_1">Klappentext</text:h>
  <text:p text:style-name="Standard"/>
#+END_SRC

