modules/sbs/dtbook-to-odt/src/main/doc/dtbook-to-odt.org
* Notes

Small footnotes are rendered inline, directly following the note
reference, in between round brackets. Inline notes get the character
style “dtb:note”.

#+BEGIN_SRC dtbook
  <dtb:p>
      Du brauchst<dtb:noteref idref="#t0138">*</dtb:noteref> nicht zu rennen.
  </dtb:p>
  <dtb:note id="t0138">
      <dtb:p>
          ,* brauchen + zu kann nur negativ oder einschränkend verwendet werden.
      </dtb:p>
  </dtb:note>
#+END_SRC
#+BEGIN_SRC odt
  <text:p text:style-name="dtb_3a_p">
      Du brauchst *
      <text:span text:style-name="dtb_3a_note">
          ( * brauchen + zu kann nur negativ oder einschränkend verwendet werden. )
      </text:span>
      nicht zu rennen.
  </text:p>
#+END_SRC

If the text of a note or note reference does not already start with an
asterisk (*), an asterisk is prepended.

Footnotes consisting of several paragraphs are rendered after the
paragraph that contains the note reference. The paragraph style
“dtb:note_footnote” is applied.

#+BEGIN_SRC dtbook
  <dtb:p>
      <dtb:noteref idref="#t0157">+</dtb:noteref>
  </dtb:p>
  <dtb:note id="t0157">
      <dtb:p>
          + Sowohl Mozart als auch Schubert waren bedeutende Komponisten.
      </dtb:p>
      <dtb:p>
          + Queen Victoria war nicht nur glücklich verheiratet, sondern (sie) hatte auch viele Kinder.
      </dtb:p>
  </dtb:note>
#+END_SRC
#+BEGIN_SRC odt
  <text:p text:style-name="dtb_3a_p">* +</text:p>
  <text:p text:style-name="dtb_3a_note_5f_footnote">
      <text:span text:style-name="dtb_3a_note">( *</text:span>
  </text:p>
  <text:p text:style-name="dtb_3a_note_5f_footnote">
      <text:span text:style-name="dtb_3a_note">
          + Sowohl Mozart als auch Schubert waren bedeutende Komponisten.
      </text:span>
  </text:p>
  <text:p text:style-name="dtb_3a_note_5f_footnote">
      <text:span text:style-name="dtb_3a_note">
          + Queen Victoria war nicht nur glücklich verheiratet, sondern (sie) hatte auch viele Kinder.
      </text:span>
  </text:p>
  <text:p text:style-name="dtb_3a_note_5f_footnote">
      <text:span text:style-name="dtb_3a_note">)</text:span>
  </text:p>
#+END_SRC

