modules/ch/sbs/pipeline/dtbook-to-odt/doc/dtbook-to-odt.html
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Notes</h2>
<div class="outline-text-2" id="text-2">
<p>
Small footnotes are rendered inline, directly following the note
reference, in between round brackets. Inline notes get the character
style “dtb:note”.
</p>

<div class="org-src-container">

<pre class="src src-dtbook"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-text">    Du brauchst</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">noteref</span> <span class="org-nxml-attribute-local-name">idref</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">#t0138</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">*</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">noteref</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text"> nicht zu rennen.</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">note</span> <span class="org-nxml-attribute-local-name">id</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">t0138</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-text">        * brauchen + zu kann nur negativ oder einschränkend verwendet werden.</span>
<span class="org-nxml-text">    </span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">note</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>
<div class="org-src-container">

<pre class="src src-odt"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span> <span class="org-nxml-attribute-prefix">text</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">style-name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">dtb_3a_p</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-text">    Du brauchst *</span>
<span class="org-nxml-text">    </span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">span</span> <span class="org-nxml-attribute-prefix">text</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">style-name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">dtb_3a_note</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-text">        ( * brauchen + zu kann nur negativ oder einschränkend verwendet werden. )</span>
<span class="org-nxml-text">    </span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">span</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-text">    nicht zu rennen.</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<p>
If the text of a note or note reference does not already start with an
asterisk (*), an asterisk is prepended.
</p>

<p>
Footnotes consisting of several paragraphs are rendered after the
paragraph that contains the note reference. The paragraph style
“dtb:note_footnote” is applied.
</p>

<div class="org-src-container">

<pre class="src src-dtbook"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">noteref</span> <span class="org-nxml-attribute-local-name">idref</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">#t0157</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">+</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">noteref</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">note</span> <span class="org-nxml-attribute-local-name">id</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">t0157</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-text">        + Sowohl Mozart als auch Schubert waren bedeutende Komponisten.</span>
<span class="org-nxml-text">    </span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-text">        + Queen Victoria war nicht nur glücklich verheiratet, sondern (sie) hatte auch viele Kinder.</span>
<span class="org-nxml-text">    </span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">note</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>
<div class="org-src-container">

<pre class="src src-odt"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span> <span class="org-nxml-attribute-prefix">text</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">style-name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">dtb_3a_p</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">* +</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span> <span class="org-nxml-attribute-prefix">text</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">style-name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">dtb_3a_note_5f_footnote</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">span</span> <span class="org-nxml-attribute-prefix">text</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">style-name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">dtb_3a_note</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">( *</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">span</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span> <span class="org-nxml-attribute-prefix">text</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">style-name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">dtb_3a_note_5f_footnote</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">span</span> <span class="org-nxml-attribute-prefix">text</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">style-name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">dtb_3a_note</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-text">        + Sowohl Mozart als auch Schubert waren bedeutende Komponisten.</span>
<span class="org-nxml-text">    </span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">span</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span> <span class="org-nxml-attribute-prefix">text</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">style-name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">dtb_3a_note_5f_footnote</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">span</span> <span class="org-nxml-attribute-prefix">text</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">style-name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">dtb_3a_note</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-text">        + Queen Victoria war nicht nur glücklich verheiratet, sondern (sie) hatte auch viele Kinder.</span>
<span class="org-nxml-text">    </span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">span</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span> <span class="org-nxml-attribute-prefix">text</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">style-name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">dtb_3a_note_5f_footnote</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">span</span> <span class="org-nxml-attribute-prefix">text</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">style-name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">dtb_3a_note</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">)</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">span</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>
</div>
</div>
