modules/sbs/dtbook-to-odt/src/main/doc/dtbook-to-odt.org
* Images

Images can either be embedded, linked or dropped. When embedded or
linked, an image appears in the document with the same dimensions as
in the original book, in a paragraph with style “dtb:img”. It is
assumed that they are scanned at 600 dpi.

Image captions are always inserted before the image as a paragraph
with style “dtb:caption”. They are preceded by an empty paragraph,
and followed by a colon (:).

#+BEGIN_SRC dtbook
  <dtb:imggroup>
      <dtb:img id="p188-001" src="p188-001.jpg" alt="image"/>
      <dtb:caption>
          Der schnellste Vogel im Sturzflug: der Wanderfalke
      </dtb:caption>
  </dtb:imggroup>
#+END_SRC
#+BEGIN_SRC odt
  <text:p text:style-name="Standard"/>
  <text:p text:style-name="dtb_3a_caption">Der schnellste Vogel im Sturzflug: der Wanderfalke :</text:p>
  <text:p text:style-name="dtb_3a_img">
      <draw:frame draw:name="dtb:img#1" draw:style-name="dtb_3a_img"
                  text:anchor-type="as-char" draw:z-index="0"
                  svg:width="1.6667in" svg:height="1.6667in">
          <draw:image xlink:href="p188-001.jpg" xlink:type="simple" xlink:show="embed" xlink:actuate="onLoad"/>
          <svg:title>image</svg:title>
      </draw:frame>
  </text:p>
#+END_SRC

