modules/ch/sbs/pipeline/dtbook-to-odt/doc/dtbook-to-odt.html
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Images</h2>
<div class="outline-text-2" id="text-3">
<p>
Images can either be embedded, linked or dropped. When embedded or
linked, an image appears in the document with the same dimensions as
in the original book, in a paragraph with style “dtb:img”. It is
assumed that they are scanned at 600 dpi.
</p>

<p>
Image captions are always inserted before the image as a paragraph
with style “dtb:caption”. They are preceded by an empty paragraph,
and followed by a colon (:).
</p>

<div class="org-src-container">

<pre class="src src-dtbook"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">imggroup</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">img</span> <span class="org-nxml-attribute-local-name">id</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">p188-001</span><span class="org-nxml-attribute-value-delimiter">"</span> <span class="org-nxml-attribute-local-name">src</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">p188-001.jpg</span><span class="org-nxml-attribute-value-delimiter">"</span> <span class="org-nxml-attribute-local-name">alt</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">image</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">caption</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-text">        Der schnellste Vogel im Sturzflug: der Wanderfalke</span>
<span class="org-nxml-text">    </span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">caption</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">imggroup</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>
<div class="org-src-container">

<pre class="src src-odt"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span> <span class="org-nxml-attribute-prefix">text</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">style-name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">Standard</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span> <span class="org-nxml-attribute-prefix">text</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">style-name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">dtb_3a_caption</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">Der schnellste Vogel im Sturzflug: der Wanderfalke :</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span> <span class="org-nxml-attribute-prefix">text</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">style-name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">dtb_3a_img</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">draw</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">frame</span> <span class="org-nxml-attribute-prefix">draw</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">dtb:img#1</span><span class="org-nxml-attribute-value-delimiter">"</span> <span class="org-nxml-attribute-prefix">draw</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">style-name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">dtb_3a_img</span><span class="org-nxml-attribute-value-delimiter">"</span>
                <span class="org-nxml-attribute-prefix">text</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">anchor-type</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">as-char</span><span class="org-nxml-attribute-value-delimiter">"</span> <span class="org-nxml-attribute-prefix">draw</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">z-index</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">0</span><span class="org-nxml-attribute-value-delimiter">"</span>
                <span class="org-nxml-attribute-prefix">svg</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">width</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">1.6667in</span><span class="org-nxml-attribute-value-delimiter">"</span> <span class="org-nxml-attribute-prefix">svg</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">height</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">1.6667in</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span>
        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">draw</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">image</span> <span class="org-nxml-attribute-prefix">xlink</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">href</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">p188-001.jpg</span><span class="org-nxml-attribute-value-delimiter">"</span> <span class="org-nxml-attribute-prefix">xlink</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">type</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">simple</span><span class="org-nxml-attribute-value-delimiter">"</span> <span class="org-nxml-attribute-prefix">xlink</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">show</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">embed</span><span class="org-nxml-attribute-value-delimiter">"</span> <span class="org-nxml-attribute-prefix">xlink</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">actuate</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">onLoad</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-tag-delimiter">&gt;</span>
        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">svg</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">title</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">image</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">svg</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">title</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">draw</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">frame</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>
</div>
</div>
