modules/sbs/dtbook-to-odt/src/main/doc/dtbook-to-odt.org
* Exercises

#+BEGIN_SRC dtbook
  <dtb:p>
      <dtb:span class="exercisenumber">3</dtb:span> Ergänzen Sie Informationen aus dem Text.
  </dtb:p>
  <dtb:p>
      <dtb:span class="exercisepart">a</dtb:span> Geburtsdatum: <dtb:span class="answer">___</dtb:span>
  </dtb:p>
  <dtb:p>
      <dtb:span class="exercisepart">b</dtb:span> Geburtsort: <dtb:span class="answer">___</dtb:span>
  </dtb:p>
#+END_SRC
#+BEGIN_SRC odt
  <text:p text:style-name="dtb_3a_p">
      <text:span text:style-name="dtb_3a_span_5f_exercisenumber">3</text:span>
      Ergänzen Sie Informationen aus dem Text.
  </text:p>
  <text:p text:style-name="dtb_3a_p">
      <text:span text:style-name="dtb_3a_span_5f_exercisepart">a</text:span>
      Geburtsdatum:
      <text:span xml:lang="none">_...</text:span>
  </text:p>
  <text:p text:style-name="dtb_3a_p">
      <text:span text:style-name="dtb_3a_span_5f_exercisepart">b</text:span>
      Geburtsort:
      <text:span xml:lang="none">_...</text:span>
  </text:p>
#+END_SRC

