modules/ch/sbs/pipeline/dtbook-to-odt/doc/dtbook-to-odt.html
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Exercises</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-dtbook"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">span</span> <span class="org-nxml-attribute-local-name">class</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">exercisenumber</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">3</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">span</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text"> Ergänzen Sie Informationen aus dem Text.</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">span</span> <span class="org-nxml-attribute-local-name">class</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">exercisepart</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">a</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">span</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text"> Geburtsdatum: </span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">span</span> <span class="org-nxml-attribute-local-name">class</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">answer</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">___</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">span</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">span</span> <span class="org-nxml-attribute-local-name">class</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">exercisepart</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">b</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">span</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text"> Geburtsort: </span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">span</span> <span class="org-nxml-attribute-local-name">class</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">answer</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">___</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">span</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>
<div class="org-src-container">

<pre class="src src-odt"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span> <span class="org-nxml-attribute-prefix">text</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">style-name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">dtb_3a_p</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">span</span> <span class="org-nxml-attribute-prefix">text</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">style-name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">dtb_3a_span_5f_exercisenumber</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">3</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">span</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-text">    Ergänzen Sie Informationen aus dem Text.</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span> <span class="org-nxml-attribute-prefix">text</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">style-name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">dtb_3a_p</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">span</span> <span class="org-nxml-attribute-prefix">text</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">style-name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">dtb_3a_span_5f_exercisepart</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">a</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">span</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-text">    Geburtsdatum:</span>
<span class="org-nxml-text">    </span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">span</span> <span class="org-nxml-attribute-prefix">xml</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">lang</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">none</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">_...</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">span</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span> <span class="org-nxml-attribute-prefix">text</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">style-name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">dtb_3a_p</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">span</span> <span class="org-nxml-attribute-prefix">text</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">style-name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">dtb_3a_span_5f_exercisepart</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">b</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">span</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-text">    Geburtsort:</span>
<span class="org-nxml-text">    </span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">span</span> <span class="org-nxml-attribute-prefix">xml</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">lang</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">none</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">_...</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">span</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>
</div>
</div>
