modules/sbs/dtbook-to-odt/src/main/doc/dtbook-to-odt.org
* Math

#+BEGIN_SRC dtbook
  <dtb:p>
      <math xmlns="http://www.w3.org/1998/Math/MathML">
          <semantics>
              <msup>
                  <mrow>
                      <mo>(</mo>
                      <mn>3</mn>
                      <mi>x</mi>
                      <mi>y</mi>
                      <mo>)</mo>
                  </mrow>
                  <mn>2</mn>
              </msup>
              <annotation encoding="ASCIIMath">(3xy)^2</annotation>
          </semantics>
      </math>
  </dtb:p>
#+END_SRC
#+BEGIN_SRC odt
  <text:p text:style-name="dtb_3a_p">
      <draw:frame draw:name="math:math#1" draw:style-name="dtb_3a_math" text:anchor-type="as-char" draw:z-index="0">
          <draw:object>
              <math:math>
                  <math:semantics>
                      <math:msup>
                          <math:mrow>
                              <math:mo>(</math:mo>
                              <math:mn>3</math:mn>
                              <math:mi>x</math:mi>
                              <math:mi>y</math:mi>
                              <math:mo>)</math:mo>
                          </math:mrow>
                          <math:mn>2</math:mn>
                      </math:msup>
                      <math:annotation encoding="ASCIIMath">(3xy)^2</math:annotation>
                  </math:semantics>
              </math:math>
          </draw:object>
          <svg:title>(3xy)^2</svg:title>
      </draw:frame>
      <text:span text:style-name="dtb_3a_span_5f_asciimath">(3xy)^2</text:span>
  </text:p>
#+END_SRC

