modules/ch/sbs/pipeline/dtbook-to-odt/doc/dtbook-to-odt.html
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Math</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">

<pre class="src src-dtbook"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">math</span> <span class="org-nxml-namespace-attribute-xmlns">xmlns</span>=<span class="org-nxml-namespace-attribute-value-delimiter">"</span><span class="org-nxml-namespace-attribute-value">http://www.w3.org/1998/Math/MathML</span><span class="org-nxml-namespace-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span>
        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">semantics</span><span class="org-nxml-tag-delimiter">&gt;</span>
            <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">msup</span><span class="org-nxml-tag-delimiter">&gt;</span>
                <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">mrow</span><span class="org-nxml-tag-delimiter">&gt;</span>
                    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">mo</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">(</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">mo</span><span class="org-nxml-tag-delimiter">&gt;</span>
                    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">mn</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">3</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">mn</span><span class="org-nxml-tag-delimiter">&gt;</span>
                    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">mi</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">x</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">mi</span><span class="org-nxml-tag-delimiter">&gt;</span>
                    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">mi</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">y</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">mi</span><span class="org-nxml-tag-delimiter">&gt;</span>
                    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">mo</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">)</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">mo</span><span class="org-nxml-tag-delimiter">&gt;</span>
                <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">mrow</span><span class="org-nxml-tag-delimiter">&gt;</span>
                <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">mn</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">2</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">mn</span><span class="org-nxml-tag-delimiter">&gt;</span>
            <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">msup</span><span class="org-nxml-tag-delimiter">&gt;</span>
            <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">annotation</span> <span class="org-nxml-attribute-local-name">encoding</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">ASCIIMath</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">(3xy)^2</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">annotation</span><span class="org-nxml-tag-delimiter">&gt;</span>
        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">semantics</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">math</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>
<div class="org-src-container">

<pre class="src src-odt"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span> <span class="org-nxml-attribute-prefix">text</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">style-name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">dtb_3a_p</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">draw</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">frame</span> <span class="org-nxml-attribute-prefix">draw</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">math:math#1</span><span class="org-nxml-attribute-value-delimiter">"</span> <span class="org-nxml-attribute-prefix">draw</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">style-name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">dtb_3a_math</span><span class="org-nxml-attribute-value-delimiter">"</span> <span class="org-nxml-attribute-prefix">text</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">anchor-type</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">as-char</span><span class="org-nxml-attribute-value-delimiter">"</span> <span class="org-nxml-attribute-prefix">draw</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">z-index</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">0</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span>
        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">draw</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">object</span><span class="org-nxml-tag-delimiter">&gt;</span>
            <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">math</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">math</span><span class="org-nxml-tag-delimiter">&gt;</span>
                <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">math</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">semantics</span><span class="org-nxml-tag-delimiter">&gt;</span>
                    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">math</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">msup</span><span class="org-nxml-tag-delimiter">&gt;</span>
                        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">math</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">mrow</span><span class="org-nxml-tag-delimiter">&gt;</span>
                            <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">math</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">mo</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">(</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">math</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">mo</span><span class="org-nxml-tag-delimiter">&gt;</span>
                            <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">math</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">mn</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">3</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">math</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">mn</span><span class="org-nxml-tag-delimiter">&gt;</span>
                            <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">math</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">mi</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">x</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">math</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">mi</span><span class="org-nxml-tag-delimiter">&gt;</span>
                            <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">math</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">mi</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">y</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">math</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">mi</span><span class="org-nxml-tag-delimiter">&gt;</span>
                            <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">math</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">mo</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">)</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">math</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">mo</span><span class="org-nxml-tag-delimiter">&gt;</span>
                        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">math</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">mrow</span><span class="org-nxml-tag-delimiter">&gt;</span>
                        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">math</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">mn</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">2</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">math</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">mn</span><span class="org-nxml-tag-delimiter">&gt;</span>
                    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">math</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">msup</span><span class="org-nxml-tag-delimiter">&gt;</span>
                    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">math</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">annotation</span> <span class="org-nxml-attribute-local-name">encoding</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">ASCIIMath</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">(3xy)^2</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">math</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">annotation</span><span class="org-nxml-tag-delimiter">&gt;</span>
                <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">math</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">semantics</span><span class="org-nxml-tag-delimiter">&gt;</span>
            <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">math</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">math</span><span class="org-nxml-tag-delimiter">&gt;</span>
        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">draw</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">object</span><span class="org-nxml-tag-delimiter">&gt;</span>
        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">svg</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">title</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">(3xy)^2</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">svg</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">title</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">draw</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">frame</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">span</span> <span class="org-nxml-attribute-prefix">text</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">style-name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">dtb_3a_span_5f_asciimath</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">(3xy)^2</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">span</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>
</div>
</div>
