modules/sbs/dtbook-to-odt/src/main/doc/dtbook-to-odt.org
* Page Numbering

#+BEGIN_SRC dtbook
  <dtb:pagenum id="p54" page="normal">54</dtb:pagenum>
#+END_SRC
#+BEGIN_SRC odt
  <text:p text:style-name="dtb_3a_pagenum">
      <text:span xml:lang="de">\\Seite</text:span> 54
  </text:p>
#+END_SRC

* Sidebars

#+BEGIN_SRC dtbook
  <dtb:sidebar render="optional">
      <dtb:p>
          Hohe Redeanteile, Belustigung auf Kosten anderer, Körpersprache („sie dröckte die
          Fingerkuppen fest ans Holz“), ironische Wiederholung, Sarkasmus, betretenes Schweigen ...
      </dtb:p>
  </dtb:sidebar>
#+END_SRC
#+BEGIN_SRC odt
  <text:section text:name="dtb:sidebar#1" text:style-name="dtb_3a_sidebar">
      <text:p text:style-name="dtb_3a_p">
          <text:span xml:lang="en">[Begin of sidebar]</text:span>
      </text:p>
      <text:p text:style-name="dtb_3a_p">
          Hohe Redeanteile, Belustigung auf Kosten anderer, Körpersprache („sie dröckte die
          Fingerkuppen fest ans Holz“), ironische Wiederholung, Sarkasmus, betretenes Schweigen ...
      </text:p>
      <text:p text:style-name="dtb_3a_p">
          <text:span xml:lang="en">[End of sidebar]</text:span>
      </text:p>
  </text:section>
#+END_SRC

* Line Numbering

