modules/sbs/dtbook-to-odt/src/main/doc/dtbook-to-odt.org
** Linegroups

#+BEGIN_SRC dtbook
  <dtb:linegroup>
      <dtb:line>
          <dtb:linenum>15</dtb:linenum> Einsamkeit und Hummelgesumm.
      </dtb:line>
  </dtb:linegroup>
#+END_SRC
#+BEGIN_SRC odt
  <text:p text:style-name="Standard">
      <text:span text:style-name="dtb_3a_linenum">Z 15</text:span>
      Einsamkeit und Hummelgesumm.
  </text:p>
#+END_SRC

** Continuous Text with Line Numbers

#+BEGIN_SRC dtbook
  <dtb:p class="precedingemptyline">
      Dann gibt es noch drei Katzen. Niko bekommt immer einen Schreck, wenn
      <dtb:span class="linenum">5</dtb:span>
      eine von ihnen um seine Beine streicht. Am schönsten findet er aber die Papageien.
      Sie sitzen in einem Käfig, der über der Theke hängt. Einer der Papageien ist weiß,
      <dtb:span class="linenum">10</dtb:span>
      der andere quietschgrün. Manchmal kreischen sie.
  </dtb:p>
#+END_SRC
#+BEGIN_SRC odt
  <text:p text:style-name="dtb_3a_p">
      Dann gibt es noch drei Katzen. Niko bekommt immer einen Schreck, wenn
  </text:p>
  <text:p text:style-name="dtb_3a_p">
      Z 5 eine von ihnen um seine Beine streicht. Am schönsten findet er aber die Papageien.
      Sie sitzen in einem Käfig, der über der Theke hängt. Einer der Papageien ist weiß,
  </text:p>
  <text:p text:style-name="dtb_3a_p">
      Z 10 der andere quietschgrün. Manchmal kreischen sie.
  </text:p>
#+END_SRC

