modules/sbs/dtbook-to-odt/src/main/doc/dtbook-to-odt.org
* Phonetic symbols

#+BEGIN_SRC dtbook
  <dtb:p>aunt /ɑːnt/</dtb:p>
  <dtb:p>book /bʊk/</dtb:p>
  <dtb:p>brother /brʌðǝ(r)/</dtb:p>
  <dtb:p>child /tʃaɪld/</dtb:p>
#+END_SRC

Phonetics enabled:

#+BEGIN_SRC odt
  <text:p text:style-name="dtb_3a_p">aunt /ɑːnt/</text:p>
  <text:p text:style-name="dtb_3a_p">book /bʊk/</text:p>
  <text:p text:style-name="dtb_3a_p">brother /brʌðǝ(r)/</text:p>
  <text:p text:style-name="dtb_3a_p">child /tʃaɪld/</text:p>
#+END_SRC

Phonetics disabled:

#+BEGIN_SRC odt
  <text:p text:style-name="dtb_3a_p">aunt /nt/</text:p>
  <text:p text:style-name="dtb_3a_p">book /bk/</text:p>
  <text:p text:style-name="dtb_3a_p">brother /brðǝ(r)/</text:p>
  <text:p text:style-name="dtb_3a_p">child /tald/</text:p>
#+END_SRC

