modules/ch/sbs/pipeline/dtbook-to-odt/doc/dtbook-to-odt.html
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">Phonetic symbols</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">

<pre class="src src-dtbook"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">aunt /ɑːnt/</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">book /bʊk/</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">brother /brʌðǝ(r)/</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">child /tʃaɪld/</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">dtb</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<p>
Phonetics enabled:
</p>

<div class="org-src-container">

<pre class="src src-odt"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span> <span class="org-nxml-attribute-prefix">text</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">style-name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">dtb_3a_p</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">aunt /ɑːnt/</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span> <span class="org-nxml-attribute-prefix">text</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">style-name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">dtb_3a_p</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">book /bʊk/</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span> <span class="org-nxml-attribute-prefix">text</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">style-name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">dtb_3a_p</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">brother /brʌðǝ(r)/</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span> <span class="org-nxml-attribute-prefix">text</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">style-name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">dtb_3a_p</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">child /tʃaɪld/</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<p>
Phonetics disabled:
</p>

<div class="org-src-container">

<pre class="src src-odt"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span> <span class="org-nxml-attribute-prefix">text</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">style-name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">dtb_3a_p</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">aunt /nt/</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span> <span class="org-nxml-attribute-prefix">text</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">style-name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">dtb_3a_p</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">book /bk/</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span> <span class="org-nxml-attribute-prefix">text</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">style-name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">dtb_3a_p</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">brother /brðǝ(r)/</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span> <span class="org-nxml-attribute-prefix">text</span><span class="org-nxml-attribute-colon">:</span><span class="org-nxml-attribute-local-name">style-name</span>=<span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-attribute-value">dtb_3a_p</span><span class="org-nxml-attribute-value-delimiter">"</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">child /tald/</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-prefix">text</span><span class="org-nxml-element-colon">:</span><span class="org-nxml-element-local-name">p</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
